// constants/marks-constants.js
export const CONTROL_TYPES = {
  0: 'Все',
  1: 'Экзамен',
  2: 'Зачет',
  3: 'Курсовая работа',
  4: 'Курсовой проект',
  5: 'Курсовая работа',
  6: 'Дифференцированный зачет',
  7: 'Канд. экзамен'
};

export const MARK_TYPES = {
  0: 'Все',
  1: 'н/я',
  2: 'неудовл.',
  3: 'удовл.',
  4: 'хорошо',
  5: 'отлично',
  6: 'незачет',
  7: 'зачет',
  8: 'освобождение'
};

export const MARK_COLORS = {
  'н/я': '#6B7280',
  'неудовл.': '#EF4444',
  'удовл.': '#F59E0B',
  'хорошо': '#10B981',
  'отлично': '#059669',
  'незачет': '#EF4444',
  'зачет': '#10B981',
  'освобождение': '#3B82F6',
  'нет': '#6B7280'
};